#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.data.azurerm_client_config.current: Reading...
module.demo.data.azurerm_client_config.current: Read complete after 0s [id=2022-07-13 06:15:15.227339798 +0000 UTC]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.demo.azurerm_key_vault.test will be created
  + resource "azurerm_key_vault" "test" {
      + access_policy                   = (known after apply)
      + enable_rbac_authorization       = true
      + enabled_for_deployment          = true
      + enabled_for_disk_encryption     = true
      + enabled_for_template_deployment = true
      + id                              = (known after apply)
      + location                        = "eastus"
      + name                            = "cqvault"
      + purge_protection_enabled        = false
      + resource_group_name             = "cq-keyvault"
      + sku_name                        = "standard"
      + soft_delete_enabled             = (known after apply)
      + soft_delete_retention_days      = 7
      + tags                            = {
          + "Environment" = "cq-provider-azure"
        }
      + tenant_id                       = "481ded03-f6a5-494f-ac75-613f7ddd967e"
      + vault_uri                       = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.demo.azurerm_key_vault_key.generated will be created
  + resource "azurerm_key_vault_key" "generated" {
      + curve              = (known after apply)
      + e                  = (known after apply)
      + id                 = (known after apply)
      + key_opts           = [
          + "decrypt",
          + "encrypt",
          + "sign",
          + "unwrapKey",
          + "verify",
          + "wrapKey",
        ]
      + key_size           = 2048
      + key_type           = "RSA"
      + key_vault_id       = (known after apply)
      + n                  = (known after apply)
      + name               = "cqkey"
      + public_key_openssh = (known after apply)
      + public_key_pem     = (known after apply)
      + tags               = {
          + "Environment" = "cq-provider-azure"
        }
      + version            = (known after apply)
      + versionless_id     = (known after apply)
      + x                  = (known after apply)
      + y                  = (known after apply)
    }

  # module.demo.azurerm_resource_group.keyvault will be created
  + resource "azurerm_resource_group" "keyvault" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "cq-keyvault"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @candiduslynx, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*